XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/pwm_reg.h
/* 0x28 : pwm_int_clear */
#define PWM_INT_CLEAR_OFFSET     (0x28)
#define PWM_CR_PWM_CH0L_CLR      PWM_CR_PWM_CH0L_CLR
#define PWM_CR_PWM_CH0L_CLR_POS  (0U)
#define PWM_CR_PWM_CH0L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH0L_CLR_MSK  (((1U << PWM_CR_PWM_CH0L_CLR_LEN) - 1) << PWM_CR_PWM_CH0L_CLR_POS)
#define PWM_CR_PWM_CH0L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH0L_CLR_LEN) - 1) << PWM_CR_PWM_CH0L_CLR_POS))
#define PWM_CR_PWM_CH0H_CLR      PWM_CR_PWM_CH0H_CLR
#define PWM_CR_PWM_CH0H_CLR_POS  (1U)
#define PWM_CR_PWM_CH0H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH0H_CLR_MSK  (((1U << PWM_CR_PWM_CH0H_CLR_LEN) - 1) << PWM_CR_PWM_CH0H_CLR_POS)
#define PWM_CR_PWM_CH0H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH0H_CLR_LEN) - 1) << PWM_CR_PWM_CH0H_CLR_POS))
#define PWM_CR_PWM_CH1L_CLR      PWM_CR_PWM_CH1L_CLR
#define PWM_CR_PWM_CH1L_CLR_POS  (2U)
#define PWM_CR_PWM_CH1L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH1L_CLR_MSK  (((1U << PWM_CR_PWM_CH1L_CLR_LEN) - 1) << PWM_CR_PWM_CH1L_CLR_POS)
#define PWM_CR_PWM_CH1L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH1L_CLR_LEN) - 1) << PWM_CR_PWM_CH1L_CLR_POS))
#define PWM_CR_PWM_CH1H_CLR      PWM_CR_PWM_CH1H_CLR
#define PWM_CR_PWM_CH1H_CLR_POS  (3U)
#define PWM_CR_PWM_CH1H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH1H_CLR_MSK  (((1U << PWM_CR_PWM_CH1H_CLR_LEN) - 1) << PWM_CR_PWM_CH1H_CLR_POS)
#define PWM_CR_PWM_CH1H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH1H_CLR_LEN) - 1) << PWM_CR_PWM_CH1H_CLR_POS))
#define PWM_CR_PWM_CH2L_CLR      PWM_CR_PWM_CH2L_CLR
#define PWM_CR_PWM_CH2L_CLR_POS  (4U)
#define PWM_CR_PWM_CH2L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH2L_CLR_MSK  (((1U << PWM_CR_PWM_CH2L_CLR_LEN) - 1) << PWM_CR_PWM_CH2L_CLR_POS)
#define PWM_CR_PWM_CH2L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH2L_CLR_LEN) - 1) << PWM_CR_PWM_CH2L_CLR_POS))
#define PWM_CR_PWM_CH2H_CLR      PWM_CR_PWM_CH2H_CLR
#define PWM_CR_PWM_CH2H_CLR_POS  (5U)
#define PWM_CR_PWM_CH2H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH2H_CLR_MSK  (((1U << PWM_CR_PWM_CH2H_CLR_LEN) - 1) << PWM_CR_PWM_CH2H_CLR_POS)
#define PWM_CR_PWM_CH2H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH2H_CLR_LEN) - 1) << PWM_CR_PWM_CH2H_CLR_POS))
#define PWM_CR_PWM_CH3L_CLR      PWM_CR_PWM_CH3L_CLR
#define PWM_CR_PWM_CH3L_CLR_POS  (6U)
#define PWM_CR_PWM_CH3L_CLR_LEN  (1U)
#define PWM_CR_PWM_CH3L_CLR_MSK  (((1U << PWM_CR_PWM_CH3L_CLR_LEN) - 1) << PWM_CR_PWM_CH3L_CLR_POS)
#define PWM_CR_PWM_CH3L_CLR_UMSK (~(((1U << PWM_CR_PWM_CH3L_CLR_LEN) - 1) << PWM_CR_PWM_CH3L_CLR_POS))
#define PWM_CR_PWM_CH3H_CLR      PWM_CR_PWM_CH3H_CLR
#define PWM_CR_PWM_CH3H_CLR_POS  (7U)
#define PWM_CR_PWM_CH3H_CLR_LEN  (1U)
#define PWM_CR_PWM_CH3H_CLR_MSK  (((1U << PWM_CR_PWM_CH3H_CLR_LEN) - 1) << PWM_CR_PWM_CH3H_CLR_POS)
#define PWM_CR_PWM_CH3H_CLR_UMSK (~(((1U << PWM_CR_PWM_CH3H_CLR_LEN) - 1) << PWM_CR_PWM_CH3H_CLR_POS))
#define PWM_CR_PWM_PRDE_CLR      PWM_CR_PWM_PRDE_CLR
#define PWM_CR_PWM_PRDE_CLR_POS  (8U)
#define PWM_CR_PWM_PRDE_CLR_LEN  (1U)
#define PWM_CR_PWM_PRDE_CLR_MSK  (((1U << PWM_CR_PWM_PRDE_CLR_LEN) - 1) << PWM_CR_PWM_PRDE_CLR_POS)
#define PWM_CR_PWM_PRDE_CLR_UMSK (~(((1U << PWM_CR_PWM_PRDE_CLR_LEN) - 1) << PWM_CR_PWM_PRDE_CLR_POS))
#define PWM_CR_PWM_BRK_CLR       PWM_CR_PWM_BRK_CLR
#define PWM_CR_PWM_BRK_CLR_POS   (9U)
#define PWM_CR_PWM_BRK_CLR_LEN   (1U)
#define PWM_CR_PWM_BRK_CLR_MSK   (((1U << PWM_CR_PWM_BRK_CLR_LEN) - 1) << PWM_CR_PWM_BRK_CLR_POS)
#define PWM_CR_PWM_BRK_CLR_UMSK  (~(((1U << PWM_CR_PWM_BRK_CLR_LEN) - 1) << PWM_CR_PWM_BRK_CLR_POS))
#define PWM_CR_PWM_REPT_CLR      PWM_CR_PWM_REPT_CLR
#define PWM_CR_PWM_REPT_CLR_POS  (10U)
#define PWM_CR_PWM_REPT_CLR_LEN  (1U)
#define PWM_CR_PWM_REPT_CLR_MSK  (((1U << PWM_CR_PWM_REPT_CLR_LEN) - 1) << PWM_CR_PWM_REPT_CLR_POS)
#define PWM_CR_PWM_REPT_CLR_UMSK (~(((1U << PWM_CR_PWM_REPT_CLR_LEN) - 1) << PWM_CR_PWM_REPT_CLR_POS))

/* 0x2C : pwm_int_en */
#define PWM_INT_EN_OFFSET       (0x2C)
#define PWM_CR_PWM_CH0L_EN      PWM_CR_PWM_CH0L_EN
#define PWM_CR_PWM_CH0L_EN_POS  (0U)
#define PWM_CR_PWM_CH0L_EN_LEN  (1U)
#define PWM_CR_PWM_CH0L_EN_MSK  (((1U << PWM_CR_PWM_CH0L_EN_LEN) - 1) << PWM_CR_PWM_CH0L_EN_POS)
#define PWM_CR_PWM_CH0L_EN_UMSK (~(((1U << PWM_CR_PWM_CH0L_EN_LEN) - 1) << PWM_CR_PWM_CH0L_EN_POS))
#define PWM_CR_PWM_CH0H_EN      PWM_CR_PWM_CH0H_EN
#define PWM_CR_PWM_CH0H_EN_POS  (1U)
#define PWM_CR_PWM_CH0H_EN_LEN  (1U)
#define PWM_CR_PWM_CH0H_EN_MSK  (((1U << PWM_CR_PWM_CH0H_EN_LEN) - 1) << PWM_CR_PWM_CH0H_EN_POS)
#define PWM_CR_PWM_CH0H_EN_UMSK (~(((1U << PWM_CR_PWM_CH0H_EN_LEN) - 1) << PWM_CR_PWM_CH0H_EN_POS))
#define PWM_CR_PWM_CH1L_EN      PWM_CR_PWM_CH1L_EN
#define PWM_CR_PWM_CH1L_EN_POS  (2U)
#define PWM_CR_PWM_CH1L_EN_LEN  (1U)
#define PWM_CR_PWM_CH1L_EN_MSK  (((1U << PWM_CR_PWM_CH1L_EN_LEN) - 1) << PWM_CR_PWM_CH1L_EN_POS)
#define PWM_CR_PWM_CH1L_EN_UMSK (~(((1U << PWM_CR_PWM_CH1L_EN_LEN) - 1) << PWM_CR_PWM_CH1L_EN_POS))
#define PWM_CR_PWM_CH1H_EN      PWM_CR_PWM_CH1H_EN
#define PWM_CR_PWM_CH1H_EN_POS  (3U)
#define PWM_CR_PWM_CH1H_EN_LEN  (1U)
#define PWM_CR_PWM_CH1H_EN_MSK  (((1U << PWM_CR_PWM_CH1H_EN_LEN) - 1) << PWM_CR_PWM_CH1H_EN_POS)
#define PWM_CR_PWM_CH1H_EN_UMSK (~(((1U << PWM_CR_PWM_CH1H_EN_LEN) - 1) << PWM_CR_PWM_CH1H_EN_POS))
#define PWM_CR_PWM_CH2L_EN      PWM_CR_PWM_CH2L_EN
#define PWM_CR_PWM_CH2L_EN_POS  (4U)
#define PWM_CR_PWM_CH2L_EN_LEN  (1U)
#define PWM_CR_PWM_CH2L_EN_MSK  (((1U << PWM_CR_PWM_CH2L_EN_LEN) - 1) << PWM_CR_PWM_CH2L_EN_POS)
#define PWM_CR_PWM_CH2L_EN_UMSK (~(((1U << PWM_CR_PWM_CH2L_EN_LEN) - 1) << PWM_CR_PWM_CH2L_EN_POS))
#define PWM_CR_PWM_CH2H_EN      PWM_CR_PWM_CH2H_EN
#define PWM_CR_PWM_CH2H_EN_POS  (5U)
#define PWM_CR_PWM_CH2H_EN_LEN  (1U)
#define PWM_CR_PWM_CH2H_EN_MSK  (((1U << PWM_CR_PWM_CH2H_EN_LEN) - 1) << PWM_CR_PWM_CH2H_EN_POS)
#define PWM_CR_PWM_CH2H_EN_UMSK (~(((1U << PWM_CR_PWM_CH2H_EN_LEN) - 1) << PWM_CR_PWM_CH2H_EN_POS))
#define PWM_CR_PWM_CH3L_EN      PWM_CR_PWM_CH3L_EN
#define PWM_CR_PWM_CH3L_EN_POS  (6U)
#define PWM_CR_PWM_CH3L_EN_LEN  (1U)
#define PWM_CR_PWM_CH3L_EN_MSK  (((1U << PWM_CR_PWM_CH3L_EN_LEN) - 1) << PWM_CR_PWM_CH3L_EN_POS)
#define PWM_CR_PWM_CH3L_EN_UMSK (~(((1U << PWM_CR_PWM_CH3L_EN_LEN) - 1) << PWM_CR_PWM_CH3L_EN_POS))
#define PWM_CR_PWM_CH3H_EN      PWM_CR_PWM_CH3H_EN
#define PWM_CR_PWM_CH3H_EN_POS  (7U)
#define PWM_CR_PWM_CH3H_EN_LEN  (1U)
#define PWM_CR_PWM_CH3H_EN_MSK  (((1U << PWM_CR_PWM_CH3H_EN_LEN) - 1) << PWM_CR_PWM_CH3H_EN_POS)
#define PWM_CR_PWM_CH3H_EN_UMSK (~(((1U << PWM_CR_PWM_CH3H_EN_LEN) - 1) << PWM_CR_PWM_CH3H_EN_POS))
#define PWM_CR_PWM_PRDE_EN      PWM_CR_PWM_PRDE_EN
#define PWM_CR_PWM_PRDE_EN_POS  (8U)
#define PWM_CR_PWM_PRDE_EN_LEN  (1U)
#define PWM_CR_PWM_PRDE_EN_MSK  (((1U << PWM_CR_PWM_PRDE_EN_LEN) - 1) << PWM_CR_PWM_PRDE_EN_POS)
#define PWM_CR_PWM_PRDE_EN_UMSK (~(((1U << PWM_CR_PWM_PRDE_EN_LEN) - 1) << PWM_CR_PWM_PRDE_EN_POS))
#define PWM_CR_PWM_BRK_EN       PWM_CR_PWM_BRK_EN
#define PWM_CR_PWM_BRK_EN_POS   (9U)
#define PWM_CR_PWM_BRK_EN_LEN   (1U)
#define PWM_CR_PWM_BRK_EN_MSK   (((1U << PWM_CR_PWM_BRK_EN_LEN) - 1) << PWM_CR_PWM_BRK_EN_POS)
#define PWM_CR_PWM_BRK_EN_UMSK  (~(((1U << PWM_CR_PWM_BRK_EN_LEN) - 1) << PWM_CR_PWM_BRK_EN_POS))
#define PWM_CR_PWM_REPT_EN      PWM_CR_PWM_REPT_EN
#define PWM_CR_PWM_REPT_EN_POS  (10U)
#define PWM_CR_PWM_REPT_EN_LEN  (1U)
#define PWM_CR_PWM_REPT_EN_MSK  (((1U << PWM_CR_PWM_REPT_EN_LEN) - 1) << PWM_CR_PWM_REPT_EN_POS)
#define PWM_CR_PWM_REPT_EN_UMSK (~(((1U << PWM_CR_PWM_REPT_EN_LEN) - 1) << PWM_CR_PWM_REPT_EN_POS))

struct pwm_channel_reg {
    /* 0x00 : pwm_config0 */
    union {
        struct {
            uint32_t pwm_clk_div      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_18   : 3;  /* [18:16],       rsvd,        0x0 */
            uint32_t pwm_stop_on_rept : 1;  /* [   19],        r/w,        0x0 */
            uint32_t pwm_adc_trg_src  : 4;  /* [23:20],        r/w,        0xf */
            uint32_t pwm_sw_break_en  : 1;  /* [   24],        r/w,        0x0 */
            uint32_t pwm_ext_break_en : 1;  /* [   25],        r/w,        0x0 */
            uint32_t pwm_ext_break_pl : 1;  /* [   26],        r/w,        0x0 */
            uint32_t pwm_stop_en      : 1;  /* [   27],        r/w,        0x0 */
            uint32_t pwm_stop_mode    : 1;  /* [   28],        r/w,        0x1 */
            uint32_t pwm_sts_stop     : 1;  /* [   29],          r,        0x0 */
            uint32_t reg_clk_sel      : 2;  /* [31:30],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_config0;

    /* 0x04 : pwm_config1 */
    union {
        struct {
            uint32_t pwm_ch0_pen : 1; /* [    0],        r/w,        0x0 */
            uint32_t pwm_ch0_psi : 1; /* [    1],        r/w,        0x0 */
            uint32_t pwm_ch0_nen : 1; /* [    2],        r/w,        0x0 */
            uint32_t pwm_ch0_nsi : 1; /* [    3],        r/w,        0x1 */
            uint32_t pwm_ch1_pen : 1; /* [    4],        r/w,        0x0 */
            uint32_t pwm_ch1_psi : 1; /* [    5],        r/w,        0x0 */
            uint32_t pwm_ch1_nen : 1; /* [    6],        r/w,        0x0 */
            uint32_t pwm_ch1_nsi : 1; /* [    7],        r/w,        0x1 */
            uint32_t pwm_ch2_pen : 1; /* [    8],        r/w,        0x0 */
            uint32_t pwm_ch2_psi : 1; /* [    9],        r/w,        0x0 */
            uint32_t pwm_ch2_nen : 1; /* [   10],        r/w,        0x0 */
            uint32_t pwm_ch2_nsi : 1; /* [   11],        r/w,        0x1 */
            uint32_t pwm_ch3_pen : 1; /* [   12],        r/w,        0x0 */
            uint32_t pwm_ch3_psi : 1; /* [   13],        r/w,        0x0 */
            uint32_t pwm_ch3_nen : 1; /* [   14],        r/w,        0x0 */
            uint32_t pwm_ch3_nsi : 1; /* [   15],        r/w,        0x1 */
            uint32_t pwm_ch0_ppl : 1; /* [   16],        r/w,        0x1 */
            uint32_t pwm_ch0_npl : 1; /* [   17],        r/w,        0x1 */
            uint32_t pwm_ch1_ppl : 1; /* [   18],        r/w,        0x1 */
            uint32_t pwm_ch1_npl : 1; /* [   19],        r/w,        0x1 */
            uint32_t pwm_ch2_ppl : 1; /* [   20],        r/w,        0x1 */
            uint32_t pwm_ch2_npl : 1; /* [   21],        r/w,        0x1 */
            uint32_t pwm_ch3_ppl : 1; /* [   22],        r/w,        0x1 */
            uint32_t pwm_ch3_npl : 1; /* [   23],        r/w,        0x1 */
            uint32_t pwm_ch0_pbs : 1; /* [   24],        r/w,        0x0 */
            uint32_t pwm_ch0_nbs : 1; /* [   25],        r/w,        0x0 */
            uint32_t pwm_ch1_pbs : 1; /* [   26],        r/w,        0x0 */
            uint32_t pwm_ch1_nbs : 1; /* [   27],        r/w,        0x0 */
            uint32_t pwm_ch2_pbs : 1; /* [   28],        r/w,        0x0 */
            uint32_t pwm_ch2_nbs : 1; /* [   29],        r/w,        0x0 */
            uint32_t pwm_ch3_pbs : 1; /* [   30],        r/w,        0x0 */
            uint32_t pwm_ch3_nbs : 1; /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_config1;

    /* 0x08 : pwm_period */
    union {
        struct {
            uint32_t pwm_period         : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_int_period_cnt : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_period;

    /* 0x0C : pwm_dead_time */
    union {
        struct {
            uint32_t pwm_ch0_dtg : 8; /* [ 7: 0],        r/w,        0x0 */
            uint32_t pwm_ch1_dtg : 8; /* [15: 8],        r/w,        0x0 */
            uint32_t pwm_ch2_dtg : 8; /* [23:16],        r/w,        0x0 */
            uint32_t pwm_ch3_dtg : 8; /* [31:24],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_dead_time;

    /* 0x10 : pwm_ch0_thre */
    union {
        struct {
            uint32_t pwm_ch0_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch0_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_ch0_thre;

    /* 0x14 : pwm_ch1_thre */
    union {
        struct {
            uint32_t pwm_ch1_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch1_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_ch1_thre;

    /* 0x18 : pwm_ch2_thre */
    union {
        struct {
            uint32_t pwm_ch2_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch2_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_ch2_thre;

