XUANTIE-RV/open-yoc/components/chip_bl606p/drivers/soc_std/bsp/regs/pwm_reg.h
    /* 0x1C : pwm_ch3_thre */
    union {
        struct {
            uint32_t pwm_ch3_threL : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_ch3_threH : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_ch3_thre;

    /* 0x20 : pwm_int_sts */
    union {
        struct {
            uint32_t pwm_ch0l_int   : 1;  /* [    0],          r,        0x0 */
            uint32_t pwm_ch0h_int   : 1;  /* [    1],          r,        0x0 */
            uint32_t pwm_ch1l_int   : 1;  /* [    2],          r,        0x0 */
            uint32_t pwm_ch1h_int   : 1;  /* [    3],          r,        0x0 */
            uint32_t pwm_ch2l_int   : 1;  /* [    4],          r,        0x0 */
            uint32_t pwm_ch2h_int   : 1;  /* [    5],          r,        0x0 */
            uint32_t pwm_ch3l_int   : 1;  /* [    6],          r,        0x0 */
            uint32_t pwm_ch3h_int   : 1;  /* [    7],          r,        0x0 */
            uint32_t pwm_prde_int   : 1;  /* [    8],          r,        0x0 */
            uint32_t pwm_brk_int    : 1;  /* [    9],          r,        0x0 */
            uint32_t pwm_rept_int   : 1;  /* [   10],          r,        0x0 */
            uint32_t reserved_11_31 : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_int_sts;

    /* 0x24 : pwm_int_mask */
    union {
        struct {
            uint32_t cr_pwm_ch0l_mask : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_pwm_ch0h_mask : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_pwm_ch1l_mask : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_pwm_ch1h_mask : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_pwm_ch2l_mask : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_pwm_ch2h_mask : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_pwm_ch3l_mask : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_pwm_ch3h_mask : 1;  /* [    7],        r/w,        0x1 */
            uint32_t cr_pwm_prde_mask : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cr_pwm_brk_mask  : 1;  /* [    9],        r/w,        0x1 */
            uint32_t cr_pwm_rept_mask : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31   : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_int_mask;

    /* 0x28 : pwm_int_clear */
    union {
        struct {
            uint32_t cr_pwm_ch0l_clr : 1;  /* [    0],        w1c,        0x0 */
            uint32_t cr_pwm_ch0h_clr : 1;  /* [    1],        w1c,        0x0 */
            uint32_t cr_pwm_ch1l_clr : 1;  /* [    2],        w1c,        0x0 */
            uint32_t cr_pwm_ch1h_clr : 1;  /* [    3],        w1c,        0x0 */
            uint32_t cr_pwm_ch2l_clr : 1;  /* [    4],        w1c,        0x0 */
            uint32_t cr_pwm_ch2h_clr : 1;  /* [    5],        w1c,        0x0 */
            uint32_t cr_pwm_ch3l_clr : 1;  /* [    6],        w1c,        0x0 */
            uint32_t cr_pwm_ch3h_clr : 1;  /* [    7],        w1c,        0x0 */
            uint32_t cr_pwm_prde_clr : 1;  /* [    8],        w1c,        0x0 */
            uint32_t cr_pwm_brk_clr  : 1;  /* [    9],        w1c,        0x0 */
            uint32_t cr_pwm_rept_clr : 1;  /* [   10],        w1c,        0x0 */
            uint32_t reserved_11_31  : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_int_clear;

    /* 0x2C : pwm_int_en */
    union {
        struct {
            uint32_t cr_pwm_ch0l_en : 1;  /* [    0],        r/w,        0x1 */
            uint32_t cr_pwm_ch0h_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t cr_pwm_ch1l_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t cr_pwm_ch1h_en : 1;  /* [    3],        r/w,        0x1 */
            uint32_t cr_pwm_ch2l_en : 1;  /* [    4],        r/w,        0x1 */
            uint32_t cr_pwm_ch2h_en : 1;  /* [    5],        r/w,        0x1 */
            uint32_t cr_pwm_ch3l_en : 1;  /* [    6],        r/w,        0x1 */
            uint32_t cr_pwm_ch3h_en : 1;  /* [    7],        r/w,        0x1 */
            uint32_t cr_pwm_prde_en : 1;  /* [    8],        r/w,        0x1 */
            uint32_t cr_pwm_brk_en  : 1;  /* [    9],        r/w,        0x0 */
            uint32_t cr_pwm_rept_en : 1;  /* [   10],        r/w,        0x1 */
            uint32_t reserved_11_31 : 21; /* [31:11],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm_int_en;
};

typedef volatile struct pwm_channel_reg pwm_channel_reg_t;

#define PWM_CHANNEL_OFFSET 0x40

#endif /* __PWM_REG_H__ */
